import type { BaseTranslation } from "../i18n-types";

const ar: BaseTranslation = {
  TITLE: "مدونة الغول",
  DESCRIPTION: ".مدونة مطور تهدف للإبداع، الإلهام و التعلم",
  WELCOME_MESSAGE: "مرحباً بكم يا رفاق!",
  WELCOME_PARAGRAPH: `
    يتطلب البقاء في المقدمة في مجال تطوير البرمجيات البحث و التعلم المستمر.
    هذه المدونة مكرسة لمشاركة خبراتي, التعمق في المواضيع التقنية و المناقشات حول أحدث و آخر الإتجاهات في مجال تطوير المواقع و البرمجيات.
    فسواء كنت من المبرمجين المخضرمين أو قد بدأت للتو، فأتمني أن تجد شيئاً ذو قيمة و مفيد بالنسبة لك هنا.
  `,
  ABOUT_PAGE_TITLE: "عني",
  ABOUT_INTRO_TITLE: "مُقدمة مختصرة",
  ABOUT_FIRST_LINE: `
    أنارجُل عصامي، متحفز بشدة و مطور ذو شغف تجاه بناء برمجيات ابتكارية و سهلة الإستخدام.
    لدي فهم قوي لمختلّف من التكنولوجيا و لغات البرمجة، بما فيهم 
    Python, JavaScript, C++, Lua, Django, Pisma,
    ReactJS, NextJS, ReactNative و Nix.
  `,
  ABOUT_SECOND_LINE: `
    أنا واثق من أنني أملك المهارات و الخبرة الضرورية لأُصبح ناجع في دور تطوير البرمجيات.
    أنا أسعي بشدة و دائماً مستعد لبذل الجهد الإضافي.
    فأنا أيضاً مفكر مبدع، و دائماً ما أبحث عن طُرق جديدة لتحسين مهاراتي و معرفتي.
  `,
  PROJECTS_PAGE_TITLE: "المشاريع",
  HOME_PAGE_TITLE: "الرئيسية",
  BLOG_PAGE_TITLE: "المدونة",
};

export default ar;
